{
	"greetingTitle": "",
	"greetingSubtitle": "",
	"sections": [
		{
			"title": "Вёрстка",
			"cards": [
				{
					"link": "https://css-live.ru/tricks/ukroshhaem-rezhimy-nalozheniya-difference-i-exclusion.html",
					"title": "Укрощаем режимы наложения: difference и exclusion",
					"description": "В статье вы узнаете, как работает наложение в целом, узнаете о нюансах двух в чем-то похожих режимов наложения — difference и exclusion, и увидите на примерах, как их применять.",
					"author": "Ана Тюдор, перевел - SelenIT",
					"tags": ["Переведено"]
				},
				{
					"link": "https://webformyself.com/davajte-uznaem-o-sootnoshenii-storon-v-css/",
					"title": "Давайте узнаем о соотношении сторон в CSS",
					"description": "Информацию о том, что такое соотношение сторон, как это делали и как это сделать по-новому вы найдете в статье",
					"author": "Ahmad Shadeed",
					"tags": ["Переведено"]
				},
				{
					"link": "https://habr.com/ru/company/skillbox/blog/579044/",
					"title": "Easing Functions – функции плавности для CSS-анимации и переходов",
					"description": "В этой статье мы погрузимся в функции плавности, рассмотрим возможности их применения для создания потрясающей естественной анимации.",
					"author": "Блог компании Skillbox",
					"tags": []
				},
				{
					"link": "https://web-standards.ru/articles/download-link/",
					"title": "Ссылка для скачивания",
					"description": "В статье в узнаете, как сделать ссылку, которая должна открывать системный диалог для сохранения файла, будь то архив, exe-файл, картинка или видео.",
					"author": "Никита Дубко",
					"tags": []
				},
				{
					"link": "https://webformyself.com/opredelenie-ustrojstv-s-vozmozhnostyu-navedeniya-ukazatelya-myshi/",
					"title": "Определение устройств с возможностью наведения указателя мыши",
					"description": "В настоящее время нам необходимо более утонченно определять, как пользователь просматривает наш сайт. К счастью, именно этой цели служат некоторые новые медиа-запросы.",
					"author": "Michelle Barker",
					"tags": ["Переведено"]
				}
			]
		},
		{
			"title": "Веб-разработка",
			"cards": [
				{
					"link": "https://nextjs.org/blog/next-12",
					"title": "Вышел Next v.12",
					"description": "Новый компилятор на Rust, поддержка React 18, нативная поддержка модулей ES6 и другие измения уже доступны в продакшене. Подробности в блоге Next.",
					"author": "Tim Neutkins & friends",
					"tags": ["English"]
				},
				{
					"link": "https://skillbox.ru/media/code/pravila-zhizni-andreya-sitnika/",
					"title": "Правила жизни Андрея Ситника",
					"description": "Ведущий фронтендер «Злых марсиан» рассказал в интервью, что читает, как всё успевает и почему выбирает Android. Он известен как активный участник опенсорс-сообщества, создатель PostCSS, Nano ID и других фронтенд-инструментов.",
					"author": "Андрей Ситник",
					"tags": []
				},
				{
					"link": "https://habr.com/ru/company/yandex_praktikum/blog/585380/",
					"title": "Как устроена «Дока»",
					"description": "Внутренняя жизнь опенсорс-проекта «Дока» описывается в блоге «Ядекс Практикума». Этот проект создан, чтобы облегчить жизнь фронтендеров и дать им возможность читать документацию, написанную человеческим языком.",
					"author": "Natalie VT",
					"tags": []
				},
				{
					"link": "https://babeljs.io/blog/2021/10/29/7.16.0",
					"title": "Доступна версия Babel 7.16.0",
					"description": "Теперь Babel поддерживает TypeScript 4.5, ESLint 8.0. О других изменениях можно прочитать в блоге инструмента.",
					"author": "Babel Team",
					"tags": ["English"]
				},
				{
					"link": "https://twitter.com/fillpackart/status/1455087327307513858",
					"title": "Почему опыт с легаси ценится не меньше работы в современном стеке",
					"description": "Известный разработчик Фил Ранжин объясняет, что программист должен уметь решать проблемы бизнеса независимо от стека. Подробности в треде в «Твиттере».",
					"author": "Фил Ранжин",
					"tags": ["Twitter"]
				},
				{
					"link": "https://youtu.be/-D3Pt4lOb3g",
					"title": "Публичное собеседование на позицию фулстека",
					"description": "В беседе подробно рассматривается вопрос семантики GET и POST, выбора между Redux и GraphQL, решается задача реализации игры «крестики-нолики» на бесконечном поле.",
					"author": "Хекслет",
					"tags": ["Youtube"]
				},
				{
					"link": "https://youtu.be/fhMVCRWpNVc",
					"title": "Всё о Haskell",
					"description": "Интервью с ярким представителем сообщества хаскелистов Александром Граниным. Где используется Haskell, в чём особенности этого языка и другие вопросы рассматриваются во время беседы.",
					"author": "АйТи Борода",
					"tags": ["Youtube"]
				}
			]
		},
		{
			"title": "Фреймворки и библиотеки",
			"cards": [
				{
					"link": "https://webformyself.com/kak-sokratit-vremya-zagruzki-prilozheniya-react-na-70/",
					"title": "Как сократить время загрузки приложения React на 70%",
					"description": "На сколько разделение кода на маршруты действительно эффективно и стоит ли использовать ленивую загрузку. Как уверяет автор статьи - однозначно стоит!",
					"author": "Nilanth",
					"tags": []
				},
				{
					"link": "https://habr.com/ru/company/timeweb/blog/585910/",
					"title": "Хочу поиск как у MDN",
					"description": "Организовать поиск можо по разному, но как сделать это качественно? Быстрый и эффективный поиск придумали ребята из MDN - эта статься подскажет Вам как можно организовать его у себя на проекте и еще много полезных фишек.",
					"author": "Igor Agapov",
					"tags": []
				},
				{
					"link": "https://stackoverflow.blog/2021/10/20/why-hooks-are-the-best-thing-to-happen-to-react/",
					"title": "Почему хуки — лучшее, что могло случиться с React",
					"description": "Если Вы по каким-то причинам все еще не используете хуки, то эта статья как раз для Вас. В статье разбираются основные моменты и примущства использования хуков.",
					"author": "Doro Onome",
					"tags": ["English"]
				},
				{
					"link": "https://highload.today/spisyvat-mozhno-8-shpargalok-s-primerami-koda-dlya-veb-razrabotchika/",
					"title": "Списывать можно: 8 шпаргалок с примерами кода для веб-разработчика",
					"description": "В школе нам говорили что списывать - это плохо, поэтому предлагаем Вашему вниманию несколько источников со шпаргалками по веб-разработке, мы плохому не научим!",
					"author": "Андрей Жоао",
					"tags": []
				},
				{
					"link": "https://ichi.pro/ru/react-vs-vue-v-2021-godu-cto-lucse-ispol-zovat-243684195750587",
					"title": "React vs Vue в 2021 году: что лучше использовать?",
					"description": "Подольем немного масла в огонь! Для кого-то любимы и извечные темы, а что лучше? Тут, как говорится, на вкус и цвет все фломастеры разные.",
					"author": "Itsourcecode.com",
					"tags": ["Переведено"]
				}
			]
		}
	]
}