{
	"greetingTitle": "",
	"greetingSubtitle": "",
	"sections": [
		{
			"title": "Вёрстка",
			"cards": [
				{
					"link": "https://habr.com/ru/company/otus/blog/580442/",
					"title": "Подробное руководство о CSS Reset библиотекахю. Почему они появились, зачем нужны, как их использовать",
					"description": "Каждый веб-проект обычно начинается с того, что дизайнер создает макет веб-страницы и передает его веб-разработчику. По мере формирования страницы будут добавляться стили CSS в ваш HTML. При проверке сайта в разных браузерах можно заметить некоторые расхождения. Эти мелкие несоответствия накапливаются со временем и в итоге дизайн вашего сайта выглядит непоследовательным во всех браузерах. Именно по этой причине люди используют сброс настроек: чтобы сайт выглядел одинаково в каждом браузере. В статье собрана информация о процедуре сброса, которая может сэкономить время отладки вашего CSS.",
					"author": "GolovinDS",
					"tags": []
				},
				{
					"link": "https://web-standards.ru/articles/extra-heading-levels/",
					"title": "Почему важно использовать разные уровни заголовках и как это влияет на доступность веб-страницы",
					"description": "Навигация по заголовкам — это самый важный способ навигации для людей, которые пользуются вспомогательными технологиями для поиска информации. Именно поэтому так важно правильно организовать заголовки на вашем сайте. В статье дается небольшое введение о заголовках с точки зрения скринридера.",
					"author": "Артём Плаксин, Веб-стандарты",
					"tags": []
				},
				{
					"link": "https://web-standards.ru/articles/five-rules-of-aria/",
					"title": "5 правил использования (и неиспользования) ARIA аттрибутов, которые помогают значительно улучшить уровень доступности страницы",
					"description": "Доступные полнофункциональные интернет-приложения (ARIA) - это набор атрибутов, которые определяют способы сделать веб-контент и веб-приложения (особенно разработанные с помощью JavaScript) более доступными для людей с ограниченными возможностями с помощью вспомогательных технологий, таких как программы чтения с экрана. В зависимости от приложения, использования только HTML недостаточно, и вам придется использовать ARIA, чтобы заполнить пробелы. В статье показаны самые базовые, самые основные правила использования ARIA в интерфейсах",
					"author": "Джерард Коэн, перевод - Глафира Жур",
					"tags": ["Переведено"]
				},
				{
					"link": "https://habr.com/ru/company/htmlacademy/blog/578224/",
					"title": "«Каждый раз, когда я работаю над компонентом, которому требуется абсолютное позиционирование, я спрашиваю себя: действительно ли это необходимо?»",
					"description": "В статье рассмотрены несколько вариантов использования, в которых абсолютное позиционирование не требуется.",
					"author": "Ahmad Shadeed",
					"tags": ["Переведено"]
				}
			]
		},
		{
			"title": "Веб-разработка",
			"cards": [
				{
					"link": "https://parceljs.org/blog/v2/",
					"title": "Вышел Parcel v2",
					"description": "В анонсе новой версии команда разработки отметила, что сборщик сохранил возможность использования Parcel без настроек как в первой версии. В то же время вторую версию удобнее использовать с большими проектами. В Parcel v2 включён по умолчанию тришейкинг, значительно увеличилась производительность, оптимизирована работа с изображениями.",
					"author": "Parcel",
					"tags": ["English"]
				},
				{
					"link": "https://skillbox.ru/media/code/kak-ya-polzuyus-betaversiey-copilot/",
					"title": "«Как я пользуюсь Copilot»",
					"description": "Фронтенд-разработчик Aviasales Игорь Камышев поделился опытом и впечатлениями от использования Copilot. Помогает ли искусственный интеллект программисту, заменят ли роботы разработчиков? Ищите ответы в статье.",
					"author": "Игорь Камышев",
					"tags": []
				},
				{
					"link": "https://doka.guide/",
					"title": "Читать доки стало приятнее благодаря ресурсу «Дока»",
					"description": "Это сайт для фронтенд-разработчиков, на котором документация написана «человеческим» языком. Главный редактор «Доки» — Вадим Макеев, известный в мире фронтенда по «Веб-стандартам» и другим проектам.",
					"author": "Дока",
					"tags": []
				},
				{
					"link": "https://www.zachleat.com/web/lighthouse-deception/",
					"title": "Дискуссия о метриках Lighthouse: искусство обмана",
					"description": "Автор статьи рассуждает об оптимизации приложений с использованием метрик Lighthouse, показывает, как показатели могут вводить в заблуждение разработчиков и владельцев сайтов.",
					"author": "Zach Leatherman",
					"tags": ["English"]
				},
				{
					"link": "https://css-tricks.com/jamstack-developers-favorite-frameworks-of-2021/",
					"title": "Самые популярные инструменты Jamstack в 2021 году",
					"description": "Netlify исследовало предпочтение разработчиков и определило, что React остаётся самым популярным инструментом для работы с UI. Какие ещё инструменты любят разработчики? Ответы в статье.",
					"author": "Laurie Voss",
					"tags": ["English"]
				}
			]
		},
		{
			"title": "Фреймворки и библиотеки",
			"cards": [
				{
					"link": "https://webformyself.com/vizualnoe-rukovodstvo-po-react-rendering-dom/",
					"title": "Morpheus - добро пожаловать в Матрицу!",
					"description": "Ребята из ATI.SU разработали аддон , который помогает в тестировании приложений и избавляет разработчиков от merge hell.Этот небольшой инструмент позволяет экономить время при разработке и тестировании фронтенд-проектов.",
					"author": "@kucheruk",
					"tags": []
				},
				{
					"link": "https://ichi.pro/ru/react-18-uze-zdes-cto-novogo-254185274431446",
					"title": "С выходом React 17 прошло чуть меньше года и вот недавно была анонсирована новая версия React 18",
					"description": "Чего ждать от новой версии и какие изменения произошли уже можно почитать в официальном блоге React или в свободном переводе",
					"author": "ICHI.PRO",
					"tags": ["Переведено"]
				},
				{
					"link": "https://nuancesprog.ru/p/14297/",
					"title": "PWA ? Chrome : «Someone else ?»",
					"description": "Google прочно сумел ассоциировать PWA c браузером и своей торговой маркой, но так ли это? Стоить ли вести разработку PWA под десктоп? Как оказалось Chrome не единственный участник на рынке PWA приложений, об этом и многом другом можно узнать из даной статьи.",
					"author": "@flancer",
					"tags": ["Переведено"]
				},
				{
					"link": "https://habr.com/ru/post/583876/",
					"title": "UI - KIT! Что ? Как ? И почему?",
					"description": "Для кого-то это покажется тратой времени и денег, а кому-то может сэкономить те же деньги и нервы. В статье рассматриваются положительные моменты от написания собственного UI - KIT и его польза для компании в целом.",
					"author": "@KOTELOV",
					"tags": []
				},
				{
					"link": "https://javascript.plainenglish.io/svelte-vs-react-ending-the-debate-799996360561",
					"title": "Вот и настал конец React !",
					"description": "...возможно когда-то мы это и услышим, но явно не сегодня или в ближайшие несколько лет. Не так давно на рынке появился очередной конкурент - Svelte, которому пророчат большое будущее.",
					"author": "Paulina Gajewska",
					"tags": ["English"]
				}
			]
		}
	]
}
